snlkuharlocal/src/Documents/ТранспортнаяНакладная/ТранспортнаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ТранспортнаяНакладная</name>
  <basedOn>Document.РасходнаяНакладная</basedOn>
  <attributes>
    <name>ДокОбъект</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказная</name>
    <type>
      <types>CatalogRef.Автомобили</types>
    </type>
  </attributes>
  <attributes>
    <name>Перевозчик</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтЛицо</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МаркаТС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>номерТС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Реквизит1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтправительФИО</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательФИО</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Сертиф</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организации</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АДОрганизаций</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомераНакладных</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Общая</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Перевозчик1</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщаяОбъем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбщееКоличество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбщаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказнаяМашина</name>
    <type>
      <types>CatalogRef.Автомобили</types>
    </type>
  </attributes>
  <attributes>
    <name>склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Пломба</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПаллет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьДоверенность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>АвторПоследнегоИзменения</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнегоИзменения</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Логист</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Накладные</name>
    <attributes>
      <name>Накладная</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Получатель</name>
      <type>
        <types>CatalogRef.Склады</types>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Отправитель</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерНакладной</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНакладная</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерСФ</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаСФ</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПунктДоставки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПаллет</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПунктДоставкиСсылка</name>
      <type>
        <types>CatalogRef.ПунктыДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>НакладнаяСсылка</name>
      <type>
        <types>DocumentRef.ЗаявкаВТранспортныйОтдел</types>
        <types>DocumentRef.ПриходнаяНакладная</types>
        <types>DocumentRef.РасходнаяНакладная</types>
        <types>DocumentRef.Перемещение</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Documents/ТранспортнаяНакладная/ObjectModule.bsl
Процедура ОбработкаЗаполнения(Основание)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда
		// Заполнение шапки
		ДокОбъект = Основание.Ссылка;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения) Экспорт
КонецПроцедуры

//крохин начало 27.10.2011
//обмен данными + контроль константы
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	Если ОбменДанными.Загрузка Тогда
	Иначе
		КонтрольДатыЗапрета(ЭтотОбъект,Отказ);			
		МожноЗаписатьДокумент(ЭтотОбъект,Отказ,РежимЗаписи,Истина);
		МожноИзменятьДокумент(ЭтотОбъект,Отказ,Истина);	
			
		//Кухарь 23.04.17 начало
		//2 новых реквизита
		если ЭтоНовый() тогда
			Автор=ПараметрыСеанса.Пользователь;
		КонецЕсли;
		АвторПоследнегоИзменения=ПараметрыСеанса.Пользователь;
		
			//Кухарь 23.04.17 конец
		//Кухарь 03.09.18 начало
	//По просьбе Лисицкого, для отчётов
		ДатаПоследнегоИзменения=ТекущаяДата();
		//Кухарь 03.09.18 конец	
		
	//крохин начало 08.09.2020
	Если ЗаказнаяМашина.Водитель.НеИспользовать Тогда
		#Если Клиент Тогда
		Сообщить("Ошибка: выбран запрещенный к использованию водитель: "+ЗаказнаяМашина.Водитель+"!");	
		#КонецЕсли
	Отказ = Истина;	
	КонецЕсли;
	//крохин конец 08.09.2020
	КонецЕсли;		
	
	Если Отказ Тогда Возврат КонецЕсли; 
	
	ЕстьИзменения		=Модифицированность();	
	НужноВыгружать		=НужноВыгружатьДокумент(ЕстьИзменения,Ссылка,РежимЗаписи,ПометкаУдаления);
	Если НужноВыгружать Тогда
		УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);	
	КонецЕсли;
	
	
КонецПроцедуры
//крохин конец 27.10.2011
